Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_dma.c
/**
  ******************************************************************************
  * @file    py32e407_hal_dma.c
  * @author  MCU Application Team
  * @brief   DMA HAL module driver.
  *         This file provides firmware functions to manage the following
  *         functionalities of the Direct Memory Access (DMA) peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral State and errors functions
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "py32e4xx_hal.h"

/** @addtogroup PY32E407_HAL_Driver
  * @{
  */

/** @defgroup DMA DMA
  * @brief DMA HAL module driver
  * @{
  */

#ifdef HAL_DMA_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @addtogroup DMA_Private_Define DMA Private Define
  * @{
  */
#define DMA_ABORT_TIMEOUT     2000U  /* DMA abort timeout */
/**
  * @}
  */
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @defgroup DMA_Private_Functions DMA Private Functions
  * @{
  */
static void DMA_SetConfig(DMA_HandleTypeDef *hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t DataLength);
static void DMA_BlockTransferComplete(DMA_HandleTypeDef *hdma);
/**
  * @}
  */
/* Exported functions ---------------------------------------------------------*/

/** @defgroup DMA_Exported_Functions DMA Exported Functions
  * @{
  */

/** @defgroup DMA_Exported_Functions_Group1 Initialization and de-initialization functions
  *  @brief   Initialization and de-initialization functions 
  *
@verbatim
 ===============================================================================
             ##### Initialization and de-initialization functions  #####
 ===============================================================================
    [..]
    This section provides functions allowing to initialize the DMA Channel source
    and destination addresses, incrementation and data sizes, transfer direction, 
    transfer type, Channel priority value.
    [..]
    The HAL_DMA_Init() function follows the DMA configuration procedures as described in
    reference manual.  

@endverbatim
  * @{
  */

/**
  * @brief  Initialize the DMA according to the specified
  *         parameters in the DMA_InitTypeDef and initialize the associated handle.
  * @param  hdma: Pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA Channel.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA_Init(DMA_HandleTypeDef *hdma)
{
  /* Check the DMA handle allocation */
  if(hdma == NULL)
  {
    return HAL_ERROR;
  }
  
  /* Check the parameters */
  assert_param(IS_DMA_ALL_INSTANCE(hdma->Instance));
  assert_param(IS_DMA_DIRECTION(hdma->Init.Direction));
  assert_param(IS_DMA_SRC_WIDTH(hdma->Init.SrcWidth));
  assert_param(IS_DMA_DST_WIDTH(hdma->Init.DstWidth));
  assert_param(IS_DMA_SRC_INC(hdma->Init.SrcInc));
  assert_param(IS_DMA_DST_INC(hdma->Init.DstInc));
  assert_param(IS_DMA_MODE(hdma->Init.Mode));
  assert_param(IS_DMA_PRIORITY(hdma->Init.Priority));
  assert_param(IS_DMA_BLOCK_MAX_LEN(hdma->Init.BlockMaxLen));
  
  #if defined (DMA2)
  /* calculation of the channel index */
  if ((uint32_t)(hdma->Instance) < (uint32_t)(DMA2_Channel1))
  {
    /* DMA1 */
    hdma->ChannelIndex = (((uint32_t)hdma->Instance - (uint32_t)DMA1_Channel1) / ((uint32_t)DMA1_Channel2 - (uint32_t)DMA1_Channel1));
    hdma->DmaBaseAddress = DMA1;
  }
  else 
  {
    /* DMA2 */
    hdma->ChannelIndex = (((uint32_t)hdma->Instance - (uint32_t)DMA2_Channel1) / ((uint32_t)DMA2_Channel2 - (uint32_t)DMA2_Channel1));
    hdma->DmaBaseAddress = DMA2;
  }
#else
  /* DMA1 */
  hdma->ChannelIndex = (((uint32_t)hdma->Instance - (uint32_t)DMA1_Channel1) / ((uint32_t)DMA1_Channel2 - (uint32_t)DMA1_Channel1));
  hdma->DmaBaseAddress = DMA1;
#endif /* DMA2 */
  
  /* Change DMA peripheral state */
  hdma->State = HAL_DMA_STATE_BUSY;
  
  /* configuration DMA_CH_CTRLLx register */
  MODIFY_REG(hdma->Instance->CH_CTRLL, (DMA_CH_CTRLL_TT | DMA_CH_CTRLL_SINC | DMA_CH_CTRLL_DINC | DMA_CH_CTRLL_SRC_TR_WIDTH | DMA_CH_CTRLL_DST_TR_WIDTH), \
                                       (hdma->Init.Direction | hdma->Init.SrcInc | hdma->Init.DstInc | hdma->Init.SrcWidth | hdma->Init.DstWidth));
  
  /* configuration DMA_CH_CFGLx register */
  MODIFY_REG(hdma->Instance->CH_CFGL, DMA_CH_CFGL_CH_PRIOR, hdma->Init.Priority);
  
  if (hdma->Init.Mode == DMA_CIRCULAR)
  {
    assert_param(IS_DMA_SRC_RELOAD(hdma->Init.SrcReload));
    assert_param(IS_DMA_DST_RELOAD(hdma->Init.DstReload));
    
    MODIFY_REG(hdma->Instance->CH_CFGL, (DMA_CH_CFGL_RELOAD_DST | DMA_CH_CFGL_RELOAD_SRC), \
                                      (hdma->Init.DstReload | hdma->Init.SrcReload));
  }
  
  /* Configure burst transaction length and handshake */
  if (hdma->Init.Direction == DMA_PERIPH_TO_PERIPH)
  {
    /* Check the parameters */
    assert_param(IS_DMA_SRC_BURST_LEN(hdma->Init.SrcBurstLen));
    assert_param(IS_DMA_DST_BURST_LEN(hdma->Init.DstBurstLen));
    
    assert_param(IS_DMA_SRC_HS(hdma->Init.SrcHandshakeType));
    assert_param(IS_DMA_DST_HS(hdma->Init.DstHandshakeType));
    
    MODIFY_REG(hdma->Instance->CH_CTRLL, (DMA_CH_CTRLL_SRC_MSIZE | DMA_CH_CTRLL_DST_MSIZE), (hdma->Init.SrcBurstLen | hdma->Init.DstBurstLen));
    
    MODIFY_REG(hdma->Instance->CH_CFGL, (DMA_CH_CFGL_HS_SEL_SRC | DMA_CH_CFGL_HS_SEL_DST), \
                                      (hdma->Init.SrcHandshakeType | hdma->Init.DstHandshakeType));
  }
  else if (hdma->Init.Direction == DMA_PERIPH_TO_MEMORY)
  {
    /* Check the parameters */
    assert_param(IS_DMA_SRC_BURST_LEN(hdma->Init.SrcBurstLen));
    
    assert_param(IS_DMA_SRC_HS(hdma->Init.SrcHandshakeType));
    
    MODIFY_REG(hdma->Instance->CH_CTRLL, DMA_CH_CTRLL_SRC_MSIZE, hdma->Init.SrcBurstLen);
    
    MODIFY_REG(hdma->Instance->CH_CFGL, DMA_CH_CFGL_HS_SEL_SRC, hdma->Init.SrcHandshakeType);
  }
  else if (hdma->Init.Direction == DMA_MEMORY_TO_PERIPH)
  {
    /* Check the parameters */
    assert_param(IS_DMA_DST_BURST_LEN(hdma->Init.DstBurstLen));
    
    assert_param(IS_DMA_DST_HS(hdma->Init.DstHandshakeType));
    
    MODIFY_REG(hdma->Instance->CH_CTRLL, DMA_CH_CTRLL_DST_MSIZE, hdma->Init.DstBurstLen);
    
