Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_dma.c
    MODIFY_REG(hdma->Instance->CH_CFGL, DMA_CH_CFGL_HS_SEL_DST, hdma->Init.DstHandshakeType);
  }
  
  /* Initialise the error code */
  hdma->ErrorCode = HAL_DMA_ERROR_NONE;

  /* Initialize the DMA state*/
  hdma->State = HAL_DMA_STATE_READY;
  /* Allocate lock resource and initialize it */
  hdma->Lock = HAL_UNLOCKED;

  return HAL_OK;
}

/**
  * @brief  DeInitialize the DMA peripheral.
  * @param  hdma: pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA Channel.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA_DeInit(DMA_HandleTypeDef *hdma)
{
  /* Check the DMA handle allocation */
  if(hdma == NULL)
  {
    return HAL_ERROR;
  }
  
  /* Check the parameters */
  assert_param(IS_DMA_ALL_INSTANCE(hdma->Instance));
  
  #if defined (DMA2)
  /* calculation of the channel index */
  if ((uint32_t)(hdma->Instance) < (uint32_t)(DMA2_Channel1))
  {
    /* DMA1 */
    hdma->ChannelIndex = (((uint32_t)hdma->Instance - (uint32_t)DMA1_Channel1) / ((uint32_t)DMA1_Channel2 - (uint32_t)DMA1_Channel1));
    hdma->DmaBaseAddress = DMA1;
  }
  else 
  {
    /* DMA2 */
    hdma->ChannelIndex = (((uint32_t)hdma->Instance - (uint32_t)DMA2_Channel1) / ((uint32_t)DMA2_Channel2 - (uint32_t)DMA2_Channel1));
    hdma->DmaBaseAddress = DMA2;
  }
#else
  /* DMA1 */
  hdma->ChannelIndex = (((uint32_t)hdma->Instance - (uint32_t)DMA1_Channel1) / ((uint32_t)DMA1_Channel2 - (uint32_t)DMA1_Channel1));
  hdma->DmaBaseAddress = DMA1;
#endif /* DMA2 */
  
  /* Disable the specified DMA Channel */
  MODIFY_REG(hdma->DmaBaseAddress->CH_EN, ((DMA_CH_EN_CH_EN_0 | DMA_CH_EN_CH_EN_WE_0) << hdma->ChannelIndex), (DMA_CH_EN_CH_EN_WE_0 << hdma->ChannelIndex));
  
  /* Reset register */
  hdma->Instance->CH_CTRLL  = 0x00304801U;
  hdma->Instance->CH_CTRLH  = 0x00000002U;
  hdma->Instance->CH_CFGL   = 0x00000e10U | (hdma->ChannelIndex << DMA_CH_CFGL_CH_PRIOR_Pos);
  hdma->Instance->CH_CFGH  = 0x00000004U;
  hdma->Instance->SA        = 0x00000000U;
  hdma->Instance->DA        = 0x00000000U;
  
  MODIFY_REG(hdma->DmaBaseAddress->MASKHALFBLOCK, ((DMA_MASKHALFBLOCK_INT_MASK_0 | DMA_MASKHALFBLOCK_INT_MASK_WE_0) << hdma->ChannelIndex), \
             (DMA_MASKHALFBLOCK_INT_MASK_WE_0 << hdma->ChannelIndex));
  MODIFY_REG(hdma->DmaBaseAddress->MASKTFR, ((DMA_MASKTFR_INT_MASK_0 | DMA_MASKTFR_INT_MASK_WE_0) << hdma->ChannelIndex), \
             (DMA_MASKTFR_INT_MASK_WE_0 << hdma->ChannelIndex));
  MODIFY_REG(hdma->DmaBaseAddress->MASKBLOCK, ((DMA_MASKBLOCK_INT_MASK_0 | DMA_MASKBLOCK_INT_MASK_WE_0) << hdma->ChannelIndex), \
             (DMA_MASKBLOCK_INT_MASK_WE_0 << hdma->ChannelIndex));
  MODIFY_REG(hdma->DmaBaseAddress->MASKSRCTRAN, ((DMA_MASKSRCTRAN_INT_MASK_0 | DMA_MASKSRCTRAN_INT_MASK_WE_0) << hdma->ChannelIndex), \
             (DMA_MASKSRCTRAN_INT_MASK_WE_0 << hdma->ChannelIndex));
  MODIFY_REG(hdma->DmaBaseAddress->MASKDSTTRAN, ((DMA_MASKDSTTRAN_INT_MASK_0 | DMA_MASKDSTTRAN_INT_MASK_WE_0) << hdma->ChannelIndex), \
             (DMA_MASKDSTTRAN_INT_MASK_WE_0 << hdma->ChannelIndex));
  MODIFY_REG(hdma->DmaBaseAddress->MASKERR, ((DMA_MASKERR_INT_MASK_0 | DMA_MASKERR_INT_MASK_WE_0) << hdma->ChannelIndex), \
             (DMA_MASKERR_INT_MASK_WE_0 << hdma->ChannelIndex));

  hdma->DmaBaseAddress->CLEARHALFBLOCK = (DMA_CLEARHALFBLOCK_CLEAR_0 << hdma->ChannelIndex);
  hdma->DmaBaseAddress->CLEARTFR       = (DMA_CLEARTFR_CLEAR_0 << hdma->ChannelIndex);
  hdma->DmaBaseAddress->CLEARBLOCK     = (DMA_CLEARBLOCK_CLEAR_0 << hdma->ChannelIndex);
  hdma->DmaBaseAddress->CLEARSRCTRAN   = (DMA_CLEARSRCTRAN_CLEAR_0 << hdma->ChannelIndex);
  hdma->DmaBaseAddress->CLEARDSTTRAN   = (DMA_CLEARDSTTRAN_CLEAR_0 << hdma->ChannelIndex);
  hdma->DmaBaseAddress->CLEARERR       = (DMA_CLEARERR_CLEAR_0 << hdma->ChannelIndex);
  
  MODIFY_REG(hdma->DmaBaseAddress->REQSRC, ((DMA_REQSRC_SRC_REQ_0 | DMA_REQSRC_SRC_REQ_WE_0) << hdma->ChannelIndex), \
             (DMA_REQSRC_SRC_REQ_WE_0 << hdma->ChannelIndex));
  MODIFY_REG(hdma->DmaBaseAddress->REQDST, ((DMA_REQDST_DST_REQ_0 | DMA_REQDST_DST_REQ_WE_0) << hdma->ChannelIndex), \
             (DMA_REQDST_DST_REQ_WE_0 << hdma->ChannelIndex));
  MODIFY_REG(hdma->DmaBaseAddress->SGLRQSRC, ((DMA_SGLRQSRC_SRC_SGLREQ_0 | DMA_SGLRQSRC_SRC_SGLREQ_WE_0) << hdma->ChannelIndex), \
             (DMA_SGLRQSRC_SRC_SGLREQ_WE_0 << hdma->ChannelIndex));
  MODIFY_REG(hdma->DmaBaseAddress->SGLRQDST, ((DMA_SGLRQDST_DST_SGLREQ_0 | DMA_SGLRQDST_DST_SGLREQ_WE_0) << hdma->ChannelIndex), \
             (DMA_SGLRQDST_DST_SGLREQ_WE_0 << hdma->ChannelIndex));
  
  /* Clean all callbacks */
  hdma->XferCpltCallback = NULL;
  hdma->XferBlockCpltCallback = NULL;
  hdma->XferHalfBlockCpltCallback = NULL;
  hdma->XferSrcTranCpltCallback = NULL;
  hdma->XferDstTranCpltCallback = NULL;
  hdma->XferErrorCallback = NULL;
  hdma->XferAbortCallback = NULL;

  /* Reset the error code */
  hdma->ErrorCode = HAL_DMA_ERROR_NONE;

  /* Reset the DMA state */
  hdma->State = HAL_DMA_STATE_RESET;

  /* Release Lock */
  __HAL_UNLOCK(hdma);

  return HAL_OK;
}


/**
  * @}
  */

/** @defgroup DMA_Exported_Functions_Group2 Input and Output operation functions
  *  @brief   Input and Output operation functions
  *
@verbatim
 ===============================================================================
                      #####  IO operation functions  #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Configure the source, destination address and data length and Start DMA transfer
      (+) Configure the source, destination address and data length and
          Start DMA transfer with interrupt
      (+) Abort DMA transfer
      (+) Poll for transfer complete
      (+) Handle DMA interrupt request

@endverbatim
  * @{
  */
/**
  * @brief  Start the DMA Transfer.
  * @param  hdma: pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA Channel.
  * @param  SrcAddress: The source memory Buffer address
  * @param  DstAddress: The destination memory Buffer address
  * @param  DataLength: The length of data to be transferred from source to destination
  * @note   In circular mode, the maximum circular transfer length does not exceed 4095.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA_Start(DMA_HandleTypeDef *hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t DataLength)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hdma);

  if(HAL_DMA_STATE_READY == hdma->State)
  {
    /* Change DMA peripheral state */
    hdma->State = HAL_DMA_STATE_BUSY;
    hdma->ErrorCode = HAL_DMA_ERROR_NONE;
            
