Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_dma.c
    /* Disable the specified DMA Channel */
    MODIFY_REG(hdma->DmaBaseAddress->CH_EN, ((DMA_CH_EN_CH_EN_0 | DMA_CH_EN_CH_EN_WE_0) << hdma->ChannelIndex), (DMA_CH_EN_CH_EN_WE_0 << hdma->ChannelIndex));
    
    /* Configure the source, destination address and the data length & clear flags*/
    DMA_SetConfig(hdma, SrcAddress, DstAddress, DataLength);
    
    /* DMA transfer from the source is not suspended */
    CLEAR_BIT(hdma->Instance->CH_CFGL, DMA_CH_CFGL_CH_SUSP);
    
    /* To set the flag bit, enable interrupt */
    SET_BIT(hdma->DmaBaseAddress->MASKHALFBLOCK, ((DMA_MASKHALFBLOCK_INT_MASK_WE_0 | DMA_MASKHALFBLOCK_INT_MASK_0) << hdma->ChannelIndex));
    
    SET_BIT(hdma->DmaBaseAddress->MASKBLOCK, ((DMA_MASKBLOCK_INT_MASK_WE_0 | DMA_MASKBLOCK_INT_MASK_0) << hdma->ChannelIndex));
    SET_BIT(hdma->DmaBaseAddress->MASKSRCTRAN, ((DMA_MASKSRCTRAN_INT_MASK_WE_0 | DMA_MASKSRCTRAN_INT_MASK_0) << hdma->ChannelIndex));
    SET_BIT(hdma->DmaBaseAddress->MASKDSTTRAN, ((DMA_MASKDSTTRAN_INT_MASK_WE_0 | DMA_MASKDSTTRAN_INT_MASK_0) << hdma->ChannelIndex));
    SET_BIT(hdma->DmaBaseAddress->MASKERR, ((DMA_MASKERR_INT_MASK_WE_0 | DMA_MASKERR_INT_MASK_0) << hdma->ChannelIndex));
    
    __HAL_DMA_ENABLE_IT(hdma);
    
    /* Enable the specified DMA */
    __HAL_DMA_ENABLE(hdma);
    
    /* Enable the specified DMA Channel */
    SET_BIT(hdma->DmaBaseAddress->CH_EN, ((DMA_CH_EN_CH_EN_WE_0 | DMA_CH_EN_CH_EN_0) << hdma->ChannelIndex));
  }
  else
  {
   /* Process Unlocked */
   __HAL_UNLOCK(hdma);  
   status = HAL_BUSY;
  }  
  return status;
}
/**
  * @brief  Start the DMA Transfer with interrupt enabled.
  * @param  hdma: pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA Channel.
  * @param  SrcAddress: The source memory Buffer address
  * @param  DstAddress: The destination memory Buffer address
  * @param  DataLength: The length of data to be transferred from source to destination
  * @note   In circular mode, the maximum circular transfer length does not exceed 4095.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA_Start_IT(DMA_HandleTypeDef *hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t DataLength)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hdma);
  
  if(HAL_DMA_STATE_READY == hdma->State)
  {
    /* Change DMA peripheral state */
    hdma->State = HAL_DMA_STATE_BUSY;
    hdma->ErrorCode = HAL_DMA_ERROR_NONE;
    
    /* Disable the specified DMA Channel */
    MODIFY_REG(hdma->DmaBaseAddress->CH_EN, ((DMA_CH_EN_CH_EN_0 | DMA_CH_EN_CH_EN_WE_0) << hdma->ChannelIndex), (DMA_CH_EN_CH_EN_WE_0 << hdma->ChannelIndex));
    
    /* Configure the source, destination address and the data length & clear flags*/
    DMA_SetConfig(hdma, SrcAddress, DstAddress, DataLength);
    
    /* DMA transfer from the source is not suspended */
    CLEAR_BIT(hdma->Instance->CH_CFGL, DMA_CH_CFGL_CH_SUSP);
    
    /* Enable the interrupt */
    if(NULL != hdma->XferHalfBlockCpltCallback)
    {
      /* Enable the Half transfer complete interrupt as well */
      SET_BIT(hdma->DmaBaseAddress->MASKHALFBLOCK, ((DMA_MASKHALFBLOCK_INT_MASK_WE_0 | DMA_MASKHALFBLOCK_INT_MASK_0) << hdma->ChannelIndex));
      
      SET_BIT(hdma->DmaBaseAddress->MASKBLOCK, ((DMA_MASKBLOCK_INT_MASK_WE_0 | DMA_MASKBLOCK_INT_MASK_0) << hdma->ChannelIndex));
      SET_BIT(hdma->DmaBaseAddress->MASKSRCTRAN, ((DMA_MASKSRCTRAN_INT_MASK_WE_0 | DMA_MASKSRCTRAN_INT_MASK_0) << hdma->ChannelIndex));
      SET_BIT(hdma->DmaBaseAddress->MASKDSTTRAN, ((DMA_MASKDSTTRAN_INT_MASK_WE_0 | DMA_MASKDSTTRAN_INT_MASK_0) << hdma->ChannelIndex));
      SET_BIT(hdma->DmaBaseAddress->MASKERR, ((DMA_MASKERR_INT_MASK_WE_0 | DMA_MASKERR_INT_MASK_0) << hdma->ChannelIndex));
    }
    else
    {
      MODIFY_REG(hdma->DmaBaseAddress->MASKHALFBLOCK, ((DMA_MASKHALFBLOCK_INT_MASK_0 | DMA_MASKHALFBLOCK_INT_MASK_WE_0) << hdma->ChannelIndex), \
             (DMA_MASKHALFBLOCK_INT_MASK_WE_0 << hdma->ChannelIndex));
      
      SET_BIT(hdma->DmaBaseAddress->MASKBLOCK, ((DMA_MASKBLOCK_INT_MASK_WE_0 | DMA_MASKBLOCK_INT_MASK_0) << hdma->ChannelIndex));
      SET_BIT(hdma->DmaBaseAddress->MASKSRCTRAN, ((DMA_MASKSRCTRAN_INT_MASK_WE_0 | DMA_MASKSRCTRAN_INT_MASK_0) << hdma->ChannelIndex));
      SET_BIT(hdma->DmaBaseAddress->MASKDSTTRAN, ((DMA_MASKDSTTRAN_INT_MASK_WE_0 | DMA_MASKDSTTRAN_INT_MASK_0) << hdma->ChannelIndex));
      SET_BIT(hdma->DmaBaseAddress->MASKERR, ((DMA_MASKERR_INT_MASK_WE_0 | DMA_MASKERR_INT_MASK_0) << hdma->ChannelIndex));
    }
    
    __HAL_DMA_ENABLE_IT(hdma);
    
    /* Enable the specified DMA */
    __HAL_DMA_ENABLE(hdma);
    
    /* Enable the specified DMA Channel */
    SET_BIT(hdma->DmaBaseAddress->CH_EN, ((DMA_CH_EN_CH_EN_WE_0 | DMA_CH_EN_CH_EN_0) << hdma->ChannelIndex));
  }
  else
  {      
    /* Process Unlocked */
    __HAL_UNLOCK(hdma); 

    /* Remain BUSY */
    status = HAL_BUSY;
  }    
  return status;
}

/**
  * @brief  Abort the DMA Transfer.
  * @param  hdma: pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA Channel.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA_Abort(DMA_HandleTypeDef *hdma)
{
  uint32_t tickstart;
  HAL_StatusTypeDef status = HAL_OK;
  
  if(hdma->State != HAL_DMA_STATE_BUSY)
  {
    /* no transfer ongoing */
    hdma->ErrorCode = HAL_DMA_ERROR_NO_XFER;
    
    /* Process Unlocked */
    __HAL_UNLOCK(hdma);
    
    return HAL_ERROR;
  }
  else
  {
    /* DMA transfer from the source is suspended */
    SET_BIT(hdma->Instance->CH_CFGL, DMA_CH_CFGL_CH_SUSP);
    
    tickstart = HAL_GetTick();
    
    /* Wait for FIFO to empty */
    while(READ_BIT(hdma->Instance->CH_CFGL, DMA_CH_CFGL_FIFO_EMPTY) == RESET)
    {
      /* Timeout management */
      if ((HAL_GetTick() - tickstart) >=  DMA_ABORT_TIMEOUT)
      {
        return HAL_ERROR;
      }
    }
    
    /* Disable DMA IT */
    MODIFY_REG(hdma->DmaBaseAddress->MASKTFR, ((DMA_MASKTFR_INT_MASK_0 | DMA_MASKTFR_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKTFR_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKBLOCK, ((DMA_MASKBLOCK_INT_MASK_0 | DMA_MASKBLOCK_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKBLOCK_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKHALFBLOCK, ((DMA_MASKHALFBLOCK_INT_MASK_0 | DMA_MASKHALFBLOCK_INT_MASK_WE_0) << hdma->ChannelIndex), \
             (DMA_MASKHALFBLOCK_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKSRCTRAN, ((DMA_MASKSRCTRAN_INT_MASK_0 | DMA_MASKSRCTRAN_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKSRCTRAN_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKDSTTRAN, ((DMA_MASKDSTTRAN_INT_MASK_0 | DMA_MASKDSTTRAN_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKDSTTRAN_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKERR, ((DMA_MASKERR_INT_MASK_0 | DMA_MASKERR_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKERR_INT_MASK_WE_0 << hdma->ChannelIndex));
    
    __HAL_DMA_DISABLE_IT(hdma);
      
    /* Disable the channel */
    MODIFY_REG(hdma->DmaBaseAddress->CH_EN, ((DMA_CH_EN_CH_EN_0 | DMA_CH_EN_CH_EN_WE_0) << hdma->ChannelIndex), \
               (DMA_CH_EN_CH_EN_WE_0 << hdma->ChannelIndex));
      
    /* Clear all flags */
    hdma->DmaBaseAddress->CLEARTFR = (DMA_CLEARTFR_CLEAR_0 << hdma->ChannelIndex);
    hdma->DmaBaseAddress->CLEARBLOCK = (DMA_CLEARBLOCK_CLEAR_0 << hdma->ChannelIndex);
    hdma->DmaBaseAddress->CLEARHALFBLOCK = (DMA_CLEARHALFBLOCK_CLEAR_0 << hdma->ChannelIndex);
    hdma->DmaBaseAddress->CLEARSRCTRAN = (DMA_CLEARSRCTRAN_CLEAR_0 << hdma->ChannelIndex);
    hdma->DmaBaseAddress->CLEARDSTTRAN = (DMA_CLEARDSTTRAN_CLEAR_0 << hdma->ChannelIndex);
    hdma->DmaBaseAddress->CLEARERR = (DMA_CLEARERR_CLEAR_0 << hdma->ChannelIndex);
  }
  /* Change the DMA state */
  hdma->State = HAL_DMA_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hdma);      
  
