Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_dma.c
  return status; 
}

/**
  * @brief  Aborts the DMA Transfer in Interrupt mode.
  * @param  hdma  : pointer to a DMA_HandleTypeDef structure that contains
  *                 the configuration information for the specified DMA Channel.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA_Abort_IT(DMA_HandleTypeDef *hdma)
{
  uint32_t tickstart;
  HAL_StatusTypeDef status = HAL_OK;
  
  if(HAL_DMA_STATE_BUSY != hdma->State)
  {
    /* no transfer ongoing */
    hdma->ErrorCode = HAL_DMA_ERROR_NO_XFER;
        
    status = HAL_ERROR;
  }
  else
  { 
    /* DMA transfer from the source is suspended */
    SET_BIT(hdma->Instance->CH_CFGL, DMA_CH_CFGL_CH_SUSP);
    
    tickstart = HAL_GetTick();
    
    /* Wait for FIFO to empty */
    while(READ_BIT(hdma->Instance->CH_CFGL, DMA_CH_CFGL_FIFO_EMPTY) == RESET)
    {
      /* Timeout management */
      if ((HAL_GetTick() - tickstart) >=  DMA_ABORT_TIMEOUT)
      {
        return HAL_ERROR;
      }
    }
    
    /* Disable DMA IT */
    MODIFY_REG(hdma->DmaBaseAddress->MASKTFR, ((DMA_MASKTFR_INT_MASK_0 | DMA_MASKTFR_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKTFR_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKBLOCK, ((DMA_MASKBLOCK_INT_MASK_0 | DMA_MASKBLOCK_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKBLOCK_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKHALFBLOCK, ((DMA_MASKHALFBLOCK_INT_MASK_0 | DMA_MASKHALFBLOCK_INT_MASK_WE_0) << hdma->ChannelIndex), \
             (DMA_MASKHALFBLOCK_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKSRCTRAN, ((DMA_MASKSRCTRAN_INT_MASK_0 | DMA_MASKSRCTRAN_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKSRCTRAN_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKDSTTRAN, ((DMA_MASKDSTTRAN_INT_MASK_0 | DMA_MASKDSTTRAN_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKDSTTRAN_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKERR, ((DMA_MASKERR_INT_MASK_0 | DMA_MASKERR_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKERR_INT_MASK_WE_0 << hdma->ChannelIndex));
    
    __HAL_DMA_DISABLE_IT(hdma);

    /* Disable the channel */
    MODIFY_REG(hdma->DmaBaseAddress->CH_EN, ((DMA_CH_EN_CH_EN_0 | DMA_CH_EN_CH_EN_WE_0) << hdma->ChannelIndex), \
               (DMA_CH_EN_CH_EN_WE_0 << hdma->ChannelIndex));

    /* Clear all flags */
    hdma->DmaBaseAddress->CLEARTFR = (DMA_CLEARTFR_CLEAR_0 << hdma->ChannelIndex);
    hdma->DmaBaseAddress->CLEARBLOCK = (DMA_CLEARBLOCK_CLEAR_0 << hdma->ChannelIndex);
    hdma->DmaBaseAddress->CLEARHALFBLOCK = (DMA_CLEARHALFBLOCK_CLEAR_0 << hdma->ChannelIndex);
    hdma->DmaBaseAddress->CLEARSRCTRAN = (DMA_CLEARSRCTRAN_CLEAR_0 << hdma->ChannelIndex);
    hdma->DmaBaseAddress->CLEARDSTTRAN = (DMA_CLEARDSTTRAN_CLEAR_0 << hdma->ChannelIndex);
    hdma->DmaBaseAddress->CLEARERR = (DMA_CLEARERR_CLEAR_0 << hdma->ChannelIndex);

    /* Change the DMA state */
    hdma->State = HAL_DMA_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(hdma);

    /* Call User Abort callback */
    if(hdma->XferAbortCallback != NULL)
    {
      hdma->XferAbortCallback(hdma);
    } 
  }
  return status;
}

/**
  * @brief  Polling for transfer complete.
  * @param  hdma:    pointer to a DMA_HandleTypeDef structure that contains
  *                  the configuration information for the specified DMA Channel.
  * @param  CompleteLevel: Specifies the DMA level complete.
  * @param  Timeout:       Timeout duration.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DMA_PollForTransfer(DMA_HandleTypeDef *hdma, uint32_t CompleteLevel, uint32_t Timeout)
{
  __IO uint32_t *statusReg = NULL;
  uint32_t temp = 0;
  uint32_t tickstart = 0U;

  if(HAL_DMA_STATE_BUSY != hdma->State)
  {
    /* no transfer ongoing */
    hdma->ErrorCode = HAL_DMA_ERROR_NO_XFER;
    __HAL_UNLOCK(hdma);
    return HAL_ERROR;
  }
  
  /* Polling mode not supported in circular mode */
  if (hdma->Init.Mode == DMA_CIRCULAR)
  {
    hdma->ErrorCode = HAL_DMA_ERROR_NOT_SUPPORTED;
    return HAL_ERROR;
  }

  /* Get the level transfer complete flag */
  if(CompleteLevel == HAL_DMA_FULL_TRANSFER)
  {
    statusReg = &(hdma->DmaBaseAddress->STATUSTFR);
    
    /* Transfer Complete flag */
    temp = (DMA_STATUSTFR_STATUS_0 << hdma->ChannelIndex);
  }
  else
  {
    statusReg = &(hdma->DmaBaseAddress->STATUSHALFBLOCK);
    
    /* Half block Transfer Complete flag */
    temp = (DMA_STATUSHALFBLOCK_STATUS_0 << hdma->ChannelIndex);
  }
  
  /* Get tick */
  tickstart = HAL_GetTick();
  
  while(((*statusReg) & temp) == RESET)
  {
    if(CompleteLevel == HAL_DMA_FULL_TRANSFER)
    {
      if ((hdma->DmaBaseAddress->STATUSBLOCK & (DMA_STATUSBLOCK_STATUS_0 << hdma->ChannelIndex)) != RESET)
      {
        /* Block transfer completion processing*/
        DMA_BlockTransferComplete(hdma);
      }
    }
    
    if ((hdma->DmaBaseAddress->STATUSERR & (DMA_STATUSERR_STATUS_0 << hdma->ChannelIndex)) != RESET)
    {
      /* When a DMA transfer error occurs */
      /* A hardware clear of its CH_EN bits is performed */
      /* Clear all flags */
      hdma->DmaBaseAddress->CLEARTFR = (DMA_CLEARTFR_CLEAR_0 << hdma->ChannelIndex);
      hdma->DmaBaseAddress->CLEARBLOCK = (DMA_CLEARBLOCK_CLEAR_0 << hdma->ChannelIndex);
      hdma->DmaBaseAddress->CLEARHALFBLOCK = (DMA_CLEARHALFBLOCK_CLEAR_0 << hdma->ChannelIndex);
      hdma->DmaBaseAddress->CLEARSRCTRAN = (DMA_CLEARSRCTRAN_CLEAR_0 << hdma->ChannelIndex);
      hdma->DmaBaseAddress->CLEARDSTTRAN = (DMA_CLEARDSTTRAN_CLEAR_0 << hdma->ChannelIndex);
      hdma->DmaBaseAddress->CLEARERR = (DMA_CLEARERR_CLEAR_0 << hdma->ChannelIndex);
      
      /* Update error code */
      SET_BIT(hdma->ErrorCode, HAL_DMA_ERROR_TE);

      /* Change the DMA state */
      hdma->State= HAL_DMA_STATE_READY;

      /* Process Unlocked */
      __HAL_UNLOCK(hdma);

      return HAL_ERROR;
    }
    
