Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_dma.c
    /* Check for the Timeout */
    if(Timeout != HAL_MAX_DELAY)
    {
      if((Timeout == 0U) || ((HAL_GetTick() - tickstart) > Timeout))
      {
        /* Update error code */
        SET_BIT(hdma->ErrorCode, HAL_DMA_ERROR_TIMEOUT);

        /* Change the DMA state */
        hdma->State = HAL_DMA_STATE_READY;

        /* Process Unlocked */
        __HAL_UNLOCK(hdma);

        return HAL_ERROR;
      }
    }
  }
  
  if(CompleteLevel == HAL_DMA_FULL_TRANSFER)
  {
    /* To do not set the flag bit, disable interrupt */
    MODIFY_REG(hdma->DmaBaseAddress->MASKTFR, ((DMA_MASKTFR_INT_MASK_0 | DMA_MASKTFR_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKTFR_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKBLOCK, ((DMA_MASKBLOCK_INT_MASK_0 | DMA_MASKBLOCK_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKBLOCK_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKHALFBLOCK, ((DMA_MASKHALFBLOCK_INT_MASK_0 | DMA_MASKHALFBLOCK_INT_MASK_WE_0) << hdma->ChannelIndex), \
             (DMA_MASKHALFBLOCK_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKSRCTRAN, ((DMA_MASKSRCTRAN_INT_MASK_0 | DMA_MASKSRCTRAN_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKSRCTRAN_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKDSTTRAN, ((DMA_MASKDSTTRAN_INT_MASK_0 | DMA_MASKDSTTRAN_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKDSTTRAN_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKERR, ((DMA_MASKERR_INT_MASK_0 | DMA_MASKERR_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKERR_INT_MASK_WE_0 << hdma->ChannelIndex));
    
    __HAL_DMA_DISABLE_IT(hdma);
    
    /* Clear the transfer complete flag */
    hdma->DmaBaseAddress->CLEARTFR = (DMA_CLEARTFR_CLEAR_0 << hdma->ChannelIndex);

    /* The selected Channelx CH_EN bit is cleared (DMA is disabled and
    all transfers are complete) */
    hdma->State = HAL_DMA_STATE_READY;
  }
  else
  {
    /* Clear the half block transfer complete flag */
    hdma->DmaBaseAddress->CLEARHALFBLOCK = (DMA_CLEARHALFBLOCK_CLEAR_0 << hdma->ChannelIndex);
  }
  
  /* Process unlocked */
  __HAL_UNLOCK(hdma);

  return HAL_OK;
}

/**
  * @brief  Handles DMA interrupt request.
  * @param  hdma: pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA Channel.  
  * @retval None
  */
void HAL_DMA_IRQHandler(DMA_HandleTypeDef *hdma)
{
  /* Source transaction completion interrupt management ******************************/
  if (((hdma->DmaBaseAddress->STATUSSRCTRAN & (DMA_STATUSSRCTRAN_STATUS_0 << hdma->ChannelIndex)) != RESET) && \
      ((hdma->DmaBaseAddress->MASKSRCTRAN & (DMA_MASKSRCTRAN_INT_MASK_0 << hdma->ChannelIndex)) != RESET))
  {
    /* Clear source transaction completion interrupt flag */
    hdma->DmaBaseAddress->CLEARSRCTRAN = (DMA_CLEARSRCTRAN_CLEAR_0 << hdma->ChannelIndex);
    
    if (hdma->XferSrcTranCpltCallback != NULL)
    {
      /* DMA source transaction complete callback */
      hdma->XferSrcTranCpltCallback(hdma);
    }
  }
  /* Destination transaction completion interrupt management ******************************/
  else if (((hdma->DmaBaseAddress->STATUSDSTTRAN & (DMA_STATUSDSTTRAN_STATUS_0 << hdma->ChannelIndex)) != RESET) && \
      ((hdma->DmaBaseAddress->MASKDSTTRAN & (DMA_MASKDSTTRAN_INT_MASK_0 << hdma->ChannelIndex)) != RESET))
  {
    /* Clear Destination transaction completion interrupt flag */
    hdma->DmaBaseAddress->CLEARDSTTRAN = (DMA_CLEARDSTTRAN_CLEAR_0 << hdma->ChannelIndex);
    
    if (hdma->XferDstTranCpltCallback != NULL)
    {
      /* DMA  destination  transaction complete callback */
      hdma->XferDstTranCpltCallback(hdma);
    }
  }
  /* Half-block transfer completion interrupt management ******************************/
  else if (((hdma->DmaBaseAddress->STATUSHALFBLOCK & (DMA_STATUSHALFBLOCK_STATUS_0 << hdma->ChannelIndex)) != RESET) && \
      ((hdma->DmaBaseAddress->MASKHALFBLOCK & (DMA_MASKHALFBLOCK_INT_MASK_0 << hdma->ChannelIndex)) != RESET))
  {
    /* Clear Half-block transfer completion interrupt flag */
    hdma->DmaBaseAddress->CLEARHALFBLOCK = (DMA_CLEARHALFBLOCK_CLEAR_0 << hdma->ChannelIndex);
    
    if (hdma->XferHalfBlockCpltCallback != NULL)
    {
      /* DMA half block transfer complete callback */
      hdma->XferHalfBlockCpltCallback(hdma);
    }
  }
  /* Block transfer completion interrupt management ******************************/
  else if (((hdma->DmaBaseAddress->STATUSBLOCK & (DMA_STATUSBLOCK_STATUS_0 << hdma->ChannelIndex)) != RESET) && \
      ((hdma->DmaBaseAddress->MASKBLOCK & (DMA_MASKBLOCK_INT_MASK_0 << hdma->ChannelIndex)) != RESET))
  {
    DMA_BlockTransferComplete(hdma);
  }
  /* Transfer Complete Interrupt management ******************************/
  else if (((hdma->DmaBaseAddress->STATUSTFR & (DMA_STATUSTFR_STATUS_0 << hdma->ChannelIndex)) != RESET) && \
      ((hdma->DmaBaseAddress->MASKTFR & (DMA_MASKTFR_INT_MASK_0 << hdma->ChannelIndex)) != RESET))
  {
    /* Disable interrupts */
    MODIFY_REG(hdma->DmaBaseAddress->MASKTFR, ((DMA_MASKTFR_INT_MASK_0 | DMA_MASKTFR_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKTFR_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKBLOCK, ((DMA_MASKBLOCK_INT_MASK_0 | DMA_MASKBLOCK_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKBLOCK_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKHALFBLOCK, ((DMA_MASKHALFBLOCK_INT_MASK_0 | DMA_MASKHALFBLOCK_INT_MASK_WE_0) << hdma->ChannelIndex), \
             (DMA_MASKHALFBLOCK_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKSRCTRAN, ((DMA_MASKSRCTRAN_INT_MASK_0 | DMA_MASKSRCTRAN_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKSRCTRAN_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKDSTTRAN, ((DMA_MASKDSTTRAN_INT_MASK_0 | DMA_MASKDSTTRAN_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKDSTTRAN_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKERR, ((DMA_MASKERR_INT_MASK_0 | DMA_MASKERR_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKERR_INT_MASK_WE_0 << hdma->ChannelIndex));
    
    __HAL_DMA_DISABLE_IT(hdma);
    
    /* Change the DMA state */
    hdma->State = HAL_DMA_STATE_READY;
    
    /* Clear the transfer complete flag */
    hdma->DmaBaseAddress->CLEARTFR = (DMA_CLEARTFR_CLEAR_0 << hdma->ChannelIndex);
    
    /* Process Unlocked */
    __HAL_UNLOCK(hdma);

    if(hdma->XferCpltCallback != NULL)
    {
      /* Transfer complete callback */
      hdma->XferCpltCallback(hdma);
    }
  }
  /* Transfer Error Interrupt management ******************************/
  else if (((hdma->DmaBaseAddress->STATUSERR & (DMA_STATUSERR_STATUS_0 << hdma->ChannelIndex)) != RESET) && \
      ((hdma->DmaBaseAddress->MASKERR & (DMA_MASKERR_INT_MASK_0 << hdma->ChannelIndex)) != RESET))
  {
    /* When a DMA transfer error occurs */
    /* A hardware clear of its CH_EN bits is performed */
    /* Disable ALL DMA IT */
    MODIFY_REG(hdma->DmaBaseAddress->MASKTFR, ((DMA_MASKTFR_INT_MASK_0 | DMA_MASKTFR_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKTFR_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKBLOCK, ((DMA_MASKBLOCK_INT_MASK_0 | DMA_MASKBLOCK_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKBLOCK_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKHALFBLOCK, ((DMA_MASKHALFBLOCK_INT_MASK_0 | DMA_MASKHALFBLOCK_INT_MASK_WE_0) << hdma->ChannelIndex), \
             (DMA_MASKHALFBLOCK_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKSRCTRAN, ((DMA_MASKSRCTRAN_INT_MASK_0 | DMA_MASKSRCTRAN_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKSRCTRAN_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKDSTTRAN, ((DMA_MASKDSTTRAN_INT_MASK_0 | DMA_MASKDSTTRAN_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKDSTTRAN_INT_MASK_WE_0 << hdma->ChannelIndex));
    MODIFY_REG(hdma->DmaBaseAddress->MASKERR, ((DMA_MASKERR_INT_MASK_0 | DMA_MASKERR_INT_MASK_WE_0) << hdma->ChannelIndex), \
               (DMA_MASKERR_INT_MASK_WE_0 << hdma->ChannelIndex));
    
    __HAL_DMA_DISABLE_IT(hdma);

    /* Clear all flags */
    hdma->DmaBaseAddress->CLEARTFR = (DMA_CLEARTFR_CLEAR_0 << hdma->ChannelIndex);
    hdma->DmaBaseAddress->CLEARBLOCK = (DMA_CLEARBLOCK_CLEAR_0 << hdma->ChannelIndex);
    hdma->DmaBaseAddress->CLEARHALFBLOCK = (DMA_CLEARHALFBLOCK_CLEAR_0 << hdma->ChannelIndex);
    hdma->DmaBaseAddress->CLEARSRCTRAN = (DMA_CLEARSRCTRAN_CLEAR_0 << hdma->ChannelIndex);
    hdma->DmaBaseAddress->CLEARDSTTRAN = (DMA_CLEARDSTTRAN_CLEAR_0 << hdma->ChannelIndex);
    hdma->DmaBaseAddress->CLEARERR = (DMA_CLEARERR_CLEAR_0 << hdma->ChannelIndex);

    /* Update error code */
    hdma->ErrorCode = HAL_DMA_ERROR_TE;

    /* Change the DMA state */
    hdma->State = HAL_DMA_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(hdma);

    if (hdma->XferErrorCallback != NULL)
    {
      /* Transfer error callback */
      hdma->XferErrorCallback(hdma);
    }
  }
  return;
}

/**
  * @brief Register callbacks
  * @param hdma: pointer to a DMA_HandleTypeDef structure that contains
  *              the configuration information for the specified DMA Channel.
  * @param CallbackID: User Callback identifer
  *                    a HAL_DMA_CallbackIDTypeDef ENUM as parameter.
  * @param pCallback: pointer to private callbacsk function which has pointer to 
  *                   a DMA_HandleTypeDef structure as parameter.
  * @retval HAL status
  */                          
HAL_StatusTypeDef HAL_DMA_RegisterCallback(DMA_HandleTypeDef *hdma, HAL_DMA_CallbackIDTypeDef CallbackID, void (* pCallback)( DMA_HandleTypeDef * _hdma))
{
  HAL_StatusTypeDef status = HAL_OK;
  
  /* Process locked */
  __HAL_LOCK(hdma);
  
  if(HAL_DMA_STATE_READY == hdma->State)
  {
    switch (CallbackID)
    {
    case  HAL_DMA_XFER_CPLT_CB_ID:
      hdma->XferCpltCallback = pCallback;
      break;
      
    case  HAL_DMA_XFER_BLOCK_CPLT_CB_ID:
      hdma->XferBlockCpltCallback = pCallback;
      break;
    
    case  HAL_DMA_XFER_HALFBLOCK_CPLT_CB_ID:
      hdma->XferHalfBlockCpltCallback = pCallback;
      break;
    
    case  HAL_DMA_XFER_SRCTRAN_CPLT_CB_ID:
      hdma->XferSrcTranCpltCallback = pCallback;
      break;
    
