Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_dma.c
    case  HAL_DMA_XFER_DSTTRAN_CPLT_CB_ID:
      hdma->XferDstTranCpltCallback = pCallback;
      break;

    case  HAL_DMA_XFER_ERROR_CB_ID:
      hdma->XferErrorCallback = pCallback;
      break;         
      
    case  HAL_DMA_XFER_ABORT_CB_ID:
      hdma->XferAbortCallback = pCallback;
      break; 
      
    default:
      status = HAL_ERROR;
      break;
    }
  }
  else
  {
    status = HAL_ERROR;
  } 
  
  /* Release Lock */
  __HAL_UNLOCK(hdma);
  
  return status;
}

/**
  * @brief UnRegister callbacks
  * @param hdma: pointer to a DMA_HandleTypeDef structure that contains
  *              the configuration information for the specified DMA Channel.
  * @param CallbackID: User Callback identifer
  *                    a HAL_DMA_CallbackIDTypeDef ENUM as parameter.
  * @retval HAL status
  */              
HAL_StatusTypeDef HAL_DMA_UnRegisterCallback(DMA_HandleTypeDef *hdma, HAL_DMA_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hdma);
  
  if(HAL_DMA_STATE_READY == hdma->State)
  {
    switch (CallbackID)
    {
    case  HAL_DMA_XFER_CPLT_CB_ID:
      hdma->XferCpltCallback = NULL;
      break;
      
    case  HAL_DMA_XFER_BLOCK_CPLT_CB_ID:
      hdma->XferBlockCpltCallback = NULL;
      break;
    
    case  HAL_DMA_XFER_HALFBLOCK_CPLT_CB_ID:
      hdma->XferHalfBlockCpltCallback = NULL;
      break;
    
    case  HAL_DMA_XFER_SRCTRAN_CPLT_CB_ID:
      hdma->XferSrcTranCpltCallback = NULL;
      break;
    
    case  HAL_DMA_XFER_DSTTRAN_CPLT_CB_ID:
      hdma->XferDstTranCpltCallback = NULL;
      break;

    case  HAL_DMA_XFER_ERROR_CB_ID:
      hdma->XferErrorCallback = NULL;
      break;         

    case  HAL_DMA_XFER_ABORT_CB_ID:
      hdma->XferAbortCallback = NULL;
      break; 

    case   HAL_DMA_XFER_ALL_CB_ID:
      hdma->XferCpltCallback = NULL;
      hdma->XferBlockCpltCallback = NULL;
      hdma->XferHalfBlockCpltCallback = NULL;
      hdma->XferSrcTranCpltCallback = NULL;
      hdma->XferDstTranCpltCallback = NULL;
      hdma->XferErrorCallback = NULL;
      hdma->XferAbortCallback = NULL;
      break; 

    default:
      status = HAL_ERROR;
      break;
    }
  }
  else
  {
    status = HAL_ERROR;
  } 
  
  /* Release Lock */
  __HAL_UNLOCK(hdma);
  
  return status;
}

/**
  * @brief  Set DMA Channel Request.
  * @param  hdma: pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA Channel.
  * @param  ReqType: DMA request type
            This parameter can be a value of @arg DMA_Req_Tpye.
  * @param  ReqNum: DMA request number
            This parameter can be a value of @arg DMA_Req_Num.
  * @param  ReqFunc: DMA request function
            This parameter can be a value of @arg DMA_Req_Func.
  * @note   This function needs to be called to configure DMA requests 
  *         only when the peripheral (non memory) is configured as hardware handshake.
  * @retval None
  */
void HAL_DMA_ChannelReq(DMA_HandleTypeDef *hdma, uint32_t ReqType, uint32_t ReqNum, uint32_t ReqFunc)
{
  uint32_t position = 0;
  
  assert_param(IS_DMA_REQ_TYPE(ReqType));
  assert_param(IS_DMA_REQ_NUM(ReqNum));
  assert_param(IS_DMA_REQ_FUNC(ReqFunc));
  
  /* Configuration request number */
  if(ReqType == DMA_REQ_TYPE_SRC)
  {
    MODIFY_REG(hdma->Instance->CH_CFGH, DMA_CH_CFGH_SRC_PER, (ReqNum << DMA_CH_CFGH_SRC_PER_Pos));
  }
  else
  {
    MODIFY_REG(hdma->Instance->CH_CFGH, DMA_CH_CFGH_DST_PER, (ReqNum << DMA_CH_CFGH_DST_PER_Pos));
  }
  
  /* Configure the requested functionality */
  if ((uint32_t)(hdma->Instance) < (uint32_t)(DMA2_Channel1))
  {
    position = ReqNum;
  }
  else 
  {
    position = ReqNum + 6;
  }
  
  __HAL_RCC_SYSCFG_CLK_ENABLE();
  
  MODIFY_REG((SYSCFG->CFGR[2 + (position >> 2)]), (0x7F << (8u * (position & 0x03u))), (ReqFunc << (8u * (position & 0x03u))));
}



/**
  * @}
  */

/** @defgroup DMA_Exported_Functions_Group3 Peripheral State and Errors functions
  *  @brief    Peripheral State and Errors functions
  *
@verbatim
 ===============================================================================
            ##### Peripheral State and Errors functions #####
 ===============================================================================  
    [..]
    This subsection provides functions allowing to
      (+) Check the DMA state
      (+) Get error code

@endverbatim
  * @{
  */

/**
  * @brief  Return the DMA hande state.
  * @param  hdma: pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA Channel.
  * @retval HAL state
  */
HAL_DMA_StateTypeDef HAL_DMA_GetState(DMA_HandleTypeDef *hdma)
{
  /* Return DMA handle state */
  return hdma->State;
}

/**
  * @brief  Return the DMA error code.
  * @param  hdma : pointer to a DMA_HandleTypeDef structure that contains
  *              the configuration information for the specified DMA Channel.
  * @retval DMA Error Code
  */
uint32_t HAL_DMA_GetError(DMA_HandleTypeDef *hdma)
{
  return hdma->ErrorCode;
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup DMA_Private_Functions
  * @{
  */

/**
  * @brief  Sets the DMA Transfer parameter.
  * @param  hdma:       pointer to a DMA_HandleTypeDef structure that contains
  *                     the configuration information for the specified DMA Channel.
  * @param  SrcAddress: The source memory Buffer address
  * @param  DstAddress: The destination memory Buffer address
  * @param  DataLength: The length of data to be transferred from source to destination
  * @retval None
  */
static void DMA_SetConfig(DMA_HandleTypeDef *hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t DataLength)
{
  /* Clear all flags */
  hdma->DmaBaseAddress->CLEARTFR = (DMA_CLEARTFR_CLEAR_0 << hdma->ChannelIndex);
  hdma->DmaBaseAddress->CLEARBLOCK = (DMA_CLEARBLOCK_CLEAR_0 << hdma->ChannelIndex);
  hdma->DmaBaseAddress->CLEARHALFBLOCK = (DMA_CLEARHALFBLOCK_CLEAR_0 << hdma->ChannelIndex);
  hdma->DmaBaseAddress->CLEARSRCTRAN = (DMA_CLEARSRCTRAN_CLEAR_0 << hdma->ChannelIndex);
  hdma->DmaBaseAddress->CLEARDSTTRAN = (DMA_CLEARDSTTRAN_CLEAR_0 << hdma->ChannelIndex);
  hdma->DmaBaseAddress->CLEARERR = (DMA_CLEARERR_CLEAR_0 << hdma->ChannelIndex);

  if (hdma->Init.Mode == DMA_CIRCULAR)
  {
    MODIFY_REG(hdma->Instance->CH_CTRLH, DMA_CH_CTRLH_BLOCK_TS, DataLength); /* Set block length */
  }
  else
  {
    /* Transferred in 1 single block */
    if (DataLength <= hdma->Init.BlockMaxLen)
    {
      CLEAR_BIT(hdma->Instance->CH_CFGL, (DMA_CH_CFGL_RELOAD_DST | DMA_CH_CFGL_RELOAD_SRC));
      
