Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_dma.c
      MODIFY_REG(hdma->Instance->CH_CTRLH, DMA_CH_CTRLH_BLOCK_TS, DataLength); /* Set block length */
      hdma->BlockNum = 1;  /* Number of blocks to be transfered */
      hdma->RemainLen = 0; /* Length remaining to be transfered (not enough for one block length) */
    }
    /* Transferred in 2 single blocks */
    else if (DataLength < (hdma->Init.BlockMaxLen * 2))
    {
      CLEAR_BIT(hdma->Instance->CH_CFGL, (DMA_CH_CFGL_RELOAD_DST | DMA_CH_CFGL_RELOAD_SRC));
      
      MODIFY_REG(hdma->Instance->CH_CTRLH, DMA_CH_CTRLH_BLOCK_TS, hdma->Init.BlockMaxLen); /* Set block length */
      hdma->BlockNum = 1;                                    /* Number of blocks to be transfered */
      hdma->RemainLen = DataLength % hdma->Init.BlockMaxLen;  /* Length remaining to be transfered (not enough for one block length) */
    }
    else
    {
      /* If the source address increment and the destination address increment are not fixed,
            the transfer is carried out according to multiple single blocks. */
      if ((hdma->Init.SrcInc != DMA_SRC_ADDR_FIX) && (hdma->Init.DstInc != DMA_DST_ADDR_FIX))
      {
        CLEAR_BIT(hdma->Instance->CH_CFGL, (DMA_CH_CFGL_RELOAD_DST | DMA_CH_CFGL_RELOAD_SRC));
      }
      /*  Transferred in multiple blocks  */
      else
      {
        if (hdma->Init.SrcInc != DMA_SRC_ADDR_FIX)
        {
          /* Address increment is not fixed, address configuration is continuous */
          CLEAR_BIT(hdma->Instance->CH_CFGL, DMA_CH_CFGL_RELOAD_SRC);
        }
        else
        {
          /* Address increment is fixed, address configuration is reloaded */
          SET_BIT(hdma->Instance->CH_CFGL, DMA_CH_CFGL_RELOAD_SRC);
        }
        
        if (hdma->Init.DstInc != DMA_DST_ADDR_FIX)
        {
          /* Address increment is not fixed, address configuration is continuous */
          CLEAR_BIT(hdma->Instance->CH_CFGL, DMA_CH_CFGL_RELOAD_DST);
        }
        else
        {
          /* Address increment is fixed, address configuration is reloaded */
          SET_BIT(hdma->Instance->CH_CFGL, DMA_CH_CFGL_RELOAD_DST);
        }
      }
      
      
      MODIFY_REG(hdma->Instance->CH_CTRLH, DMA_CH_CTRLH_BLOCK_TS, hdma->Init.BlockMaxLen); /* Set block length */
      hdma->BlockNum = DataLength / hdma->Init.BlockMaxLen;   /* Number of blocks to be transfered */
      hdma->RemainLen = DataLength % hdma->Init.BlockMaxLen;  /* Length remaining to be transfered (not enough for one block length) */
    }
  }
  
  /* Configure DMA Channel source and destination address */
  hdma->Instance->SA = SrcAddress;
  hdma->Instance->DA = DstAddress;
}

/**
  * @brief  Handle block transfer complete.
  * @param  hdma:       pointer to a DMA_HandleTypeDef structure that contains
  *                     the configuration information for the specified DMA Channel.
  * @retval None
  */
static void DMA_BlockTransferComplete(DMA_HandleTypeDef *hdma)
{
  uint32_t temp = 0;
  if (hdma->Init.Mode != DMA_CIRCULAR)
  {
    hdma->BlockNum--;
    
    /* At least two blocks(block size: hdma->Init.BlockMaxLen) need to be transferred */
    if (hdma->BlockNum >= 1)
    {
      /* If the source address increment and the destination address increment are not fixed,
            the transfer is carried out according to multiple single blocks. */
      if ((hdma->Init.SrcInc != DMA_SRC_ADDR_FIX) && (hdma->Init.DstInc != DMA_DST_ADDR_FIX))
      {
          /* Clear DMA transfer complete flag */
          hdma->DmaBaseAddress->CLEARTFR = (DMA_CLEARTFR_CLEAR_0 << hdma->ChannelIndex);
          
          /*  Clear DMA block transfer complete flag  */
          hdma->DmaBaseAddress->CLEARBLOCK = (DMA_CLEARBLOCK_CLEAR_0 << hdma->ChannelIndex);
          
          if(hdma->XferBlockCpltCallback != NULL)  
          {
            /* DMA block transfer complete callback */
            hdma->XferBlockCpltCallback(hdma);
          }
          
          SET_BIT(hdma->DmaBaseAddress->CH_EN, ((DMA_CH_EN_CH_EN_WE_0 | DMA_CH_EN_CH_EN_0) << hdma->ChannelIndex)); /* Enable CHANNEL */
          return;
      }
      else
      {
        if (hdma->BlockNum == 1)
        {
          /*  The next block is the last block of the multiblock transfer,so disable automatic reload of
              source address and destination address. */
          CLEAR_BIT(hdma->Instance->CH_CFGL, (DMA_CH_CFGL_RELOAD_SRC | DMA_CH_CFGL_RELOAD_DST));
        }
      }
    }
    
    if ((hdma->BlockNum == 0) && (hdma->RemainLen != 0))
    {
      /* Clear DMA transfer complete flag */
      hdma->DmaBaseAddress->CLEARTFR = (DMA_CLEARTFR_CLEAR_0 << hdma->ChannelIndex);
      
      /*  Clear DMA block transfer complete flag  */
      hdma->DmaBaseAddress->CLEARBLOCK = (DMA_CLEARBLOCK_CLEAR_0 << hdma->ChannelIndex);
      
      if(hdma->XferBlockCpltCallback != NULL)  
      {
        /* DMA block transfer complete callback */
        hdma->XferBlockCpltCallback(hdma);
      }
      
      /* Adjust the block length to the remaining length and transfer as a single block */
      temp =  hdma->RemainLen;
      MODIFY_REG(hdma->Instance->CH_CTRLH, DMA_CH_CTRLH_BLOCK_TS, temp); /* Set block length */
      hdma->BlockNum = 1;  /* Number of blocks to be transfered */
      hdma->RemainLen = 0; /* Length remaining to be transfered */
      SET_BIT(hdma->DmaBaseAddress->CH_EN, ((DMA_CH_EN_CH_EN_WE_0 | DMA_CH_EN_CH_EN_0) << hdma->ChannelIndex)); /* Enable CHANNEL */
      return;
    }
    
    if ((hdma->BlockNum == 0) && (hdma->RemainLen == 0))
    {
      /* Data transfer complete, final processing at DMA transfer completion interrupt */
      SET_BIT(hdma->DmaBaseAddress->MASKTFR, ((DMA_MASKTFR_INT_MASK_WE_0 | DMA_MASKTFR_INT_MASK_0) << hdma->ChannelIndex));
    }
  }
  
  /*  Clear DMA block transfer complete flag  */
  hdma->DmaBaseAddress->CLEARBLOCK = (DMA_CLEARBLOCK_CLEAR_0 << hdma->ChannelIndex);
  
  if(hdma->XferBlockCpltCallback != NULL)  
  {
    /* DMA block transfer complete callback */
    hdma->XferBlockCpltCallback(hdma);
  }
}


/**
  * @}
  */

#endif /* HAL_DMA_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
